In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avacado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))

In [20]:
df.iloc[:4, 1] = NA

In [21]:
df.iloc[:2, 2] = NA

In [22]:
df

          0         1         2
0 -1.705973       NaN       NaN
1  0.072692       NaN       NaN
2 -0.214538       NaN -0.338526
3  0.342374       NaN  0.331765
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [23]:
df.dropna()

          0         1         2
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [24]:
df.dropna(thresh=2)

          0         1         2
2 -0.214538       NaN -0.338526
3  0.342374       NaN  0.331765
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [25]:
df.fillna(0)

          0         1         2
0 -1.705973  0.000000  0.000000
1  0.072692  0.000000  0.000000
2 -0.214538  0.000000 -0.338526
3  0.342374  0.000000  0.331765
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [26]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.705973  0.500000  0.000000
1  0.072692  0.500000  0.000000
2 -0.214538  0.500000 -0.338526
3  0.342374  0.500000  0.331765
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [27]:
_ = df.fillna(0, inplace=True)

In [28]:
df

          0         1         2
0 -1.705973  0.000000  0.000000
1  0.072692  0.000000  0.000000
2 -0.214538  0.000000 -0.338526
3  0.342374  0.000000  0.331765
4 -0.585703  0.482418  0.304913
5  1.365104 -0.431354 -1.208577
6  1.245561  0.438986  1.486845

In [29]:
df = pd.DataFrame(np.random.randn(6, 3))

In [30]:
df.iloc[2:, 1] = NA

In [31]:
df.iloc[4:, 2] = NA

In [32]:
df

          0         1         2
0  0.010918  1.061514 -1.154193
1  1.655118  1.048235 -0.428525
2 -1.937409       NaN  0.318316
3  0.497568       NaN -1.158060
4 -1.401369       NaN       NaN
5 -0.062911       NaN       NaN

In [33]:
df.fillna(method='ffill')

          0         1         2
0  0.010918  1.061514 -1.154193
1  1.655118  1.048235 -0.428525
2 -1.937409  1.048235  0.318316
3  0.497568  1.048235 -1.158060
4 -1.401369  1.048235 -1.158060
5 -0.062911  1.048235 -1.158060

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.010918  1.061514 -1.154193
1  1.655118  1.048235 -0.428525
2 -1.937409  1.048235  0.318316
3  0.497568  1.048235 -1.158060
4 -1.401369       NaN -1.158060
5 -0.062911       NaN -1.158060

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [46]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [47]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami':'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [53]:
lowercased = data['food'].str.lower()

In [54]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [57]:
data['animal'] = lowercased.map(meat_to_animal)

In [58]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [62]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])

In [63]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
data.loc[-1] = ['bacon', 9.0, 'pig']

In [66]:
data

           food  ounces  animal
 0        bacon     4.0     pig
 1  pulled pork     3.0     pig
 2        bacon    12.0     pig
 3     Pastrami     6.0     cow
 4  corned beef     7.5     cow
 5        Bacon     8.0     pig
 6     pastrami     3.0     cow
 7    honey ham     5.0     pig
 8     nova lox     6.0  salmon
-1        bacon     9.0     pig

In [67]:
data.index += 1

In [70]:
data = data.sort_index()

In [71]:
data

          food  ounces  animal
0        bacon     9.0     pig
1        bacon     4.0     pig
2  pulled pork     3.0     pig
3        bacon    12.0     pig
4     Pastrami     6.0     cow
5  corned beef     7.5     cow
6        Bacon     8.0     pig
7     pastrami     3.0     cow
8    honey ham     5.0     pig
9     nova lox     6.0  salmon

In [78]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [79]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [80]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [81]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [82]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [91]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [92]:
transform = lambda x: x[:4].upper()

In [93]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [95]:
data.index = data.index.map(transform)

In [96]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [98]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [102]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [104]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [105]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [106]:
data.index = data.index.map(transform)

In [107]:
data

      one  two  three  four
INDI    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [108]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [109]:
bins = [18, 25, 35, 60, 100]

In [110]:
cats = pd.cut(ages, bins)

In [111]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [112]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [113]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [114]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [115]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [116]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [117]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [119]:
data = np.random.rand(20)

In [120]:
pd.cut(data, 4, precision=2)

[(0.52, 0.76], (0.76, 1.0], (0.05, 0.29], (0.76, 1.0], (0.05, 0.29], ..., (0.29, 0.52], (0.05, 0.29], (0.29, 0.52], (0.76, 1.0], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64, right]): [(0.05, 0.29] < (0.29, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [121]:
data = np.random.randn(1000)

In [122]:
cats = pd.qcut(data, 4)

In [123]:
cats

[(-3.629, -0.686], (-3.629, -0.686], (0.747, 3.899], (0.747, 3.899], (0.0245, 0.747], ..., (-0.686, 0.0245], (0.0245, 0.747], (0.0245, 0.747], (-3.629, -0.686], (0.747, 3.899]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.629, -0.686] < (-0.686, 0.0245] < (0.0245, 0.747] < (0.747, 3.899]]

In [124]:
pd.value_counts(cats)

(-3.629, -0.686]    250
(-0.686, 0.0245]    250
(0.0245, 0.747]     250
(0.747, 3.899]      250
dtype: int64

In [125]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-3.629, -1.227], (-3.629, -1.227], (1.252, 3.899], (0.0245, 1.252], (0.0245, 1.252], ..., (-1.227, 0.0245], (0.0245, 1.252], (0.0245, 1.252], (-1.227, 0.0245], (1.252, 3.899]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.629, -1.227] < (-1.227, 0.0245] < (0.0245, 1.252] < (1.252, 3.899]]

In [127]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [128]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010519     0.027633     0.017470    -0.010174
std       0.985117     0.992599     0.963536     1.029617
min      -3.162341    -3.842117    -3.538617    -3.470208
25%      -0.645623    -0.623868    -0.649097    -0.680252
50%      -0.008939     0.015048     0.020825    -0.033364
75%       0.725348     0.664855     0.689241     0.688604
max       2.599831     3.302743     3.244146     2.872530

In [129]:
col = data[2]

In [131]:
col[np.abs(col) > 3]

41     3.232208
81    -3.538617
530    3.244146
965   -3.131943
Name: 2, dtype: float64

In [138]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
41  -0.007593 -0.092867  3.232208  0.434354
81  -0.697652 -0.070963 -3.538617 -0.407570
144  0.766969 -0.959683  0.720514 -3.470208
165 -0.462307  1.455523  0.491957 -3.358532
191  0.053590  3.302743  0.331478 -2.532474
530 -0.410274  0.559622  3.244146  1.345908
550 -3.162341  0.856705  1.859879 -1.710599
552  0.268332 -3.842117  1.100550 -0.646694
553 -0.496969 -0.151546  0.979155 -3.186567
682 -0.616544  3.271052  0.372839 -1.643226
965  0.045757  0.412810 -3.131943  1.135689

In [139]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [141]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010681     0.027901     0.017664    -0.009159
std       0.984607     0.987855     0.959732     1.026473
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.645623    -0.623868    -0.649097    -0.680252
50%      -0.008939     0.015048     0.020825    -0.033364
75%       0.725348     0.664855     0.689241     0.688604
max       2.599831     3.000000     3.000000     2.872530

In [142]:
 df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [143]:
sampler = np.random.permutation(5)

In [144]:
sampler

array([3, 1, 0, 4, 2])

In [145]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [146]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [147]:
choices = pd.Series([5, 7, -1, 6, 4])

In [148]:
draws = choices.sample(n=10, replace=True)

In [150]:
draws

3    6
1    7
2   -1
0    5
0    5
1    7
2   -1
2   -1
3    6
0    5
dtype: int64

In [153]:
df.sample(n=2, axis='columns')

    0   3
0   0   3
1   4   7
2   8  11
3  12  15
4  16  19

In [154]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                   'data1': range(6)})

In [157]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [158]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [159]:
df_with_dummy = df[['data1']].join(dummies)

In [160]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [161]:
mnames = ['movie_id', 'title', 'genres']

In [162]:
dummies = dummies.sample(frac=1)

In [163]:
dummies

   key_a  key_b  key_c
4      1      0      0
5      0      1      0
1      0      1      0
3      0      0      1
2      1      0      0
0      0      1      0

In [164]:
df_with_dummy = df[['data1']].join(dummies)

In [165]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [175]:
movies = pd.read_table('ml-1m/movies.dat', sep='::',
                       header=None, names=mnames, encoding='ISO-8859-1')

In [176]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [178]:
all_genres = []

In [180]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [181]:
genres = pd.unique(all_genres)

In [185]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [186]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [187]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [188]:
gen = movies.genres[0]

In [189]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [191]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [194]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [195]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [196]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [197]:
np.random.seed(12345)

In [198]:
values = np.random.rand(10)

In [199]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [200]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [201]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [202]:
val = 'a,b,   guido'

In [203]:
val.split(',')

['a', 'b', '   guido']

In [204]:
pieces = [x.strip() for x in val.split(',')]

In [205]:
val

'a,b,   guido'

In [206]:
pieces

['a', 'b', 'guido']

In [207]:
first, second, third = pieces

In [208]:
first + '::' + second + '::' + third

'a::b::guido'

In [209]:
'::'.join(pieces)

'a::b::guido'

In [210]:
'guido' in val

True

In [212]:
val.index(',')

1

In [213]:
val.find(':')

-1

In [215]:
val.count(',')

2

In [216]:
val.replace(',', '::')

'a::b::   guido'

In [217]:
val.replace(',', '')

'ab   guido'

In [218]:
import re

In [221]:
text = "foo    bar\t  baz  \n\tqux"

In [222]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [228]:
regex = re.compile('\s+')

In [229]:
regex.findall(text)

['    ', '\t  ', '  \n\t']

In [230]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [231]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [234]:
# re.IGNORECASE  makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [235]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [236]:
m = regex.search(text)

In [237]:
m

In [239]:
text[m.start():m.end()]

'dave@google.com'

In [240]:
print(regex.match(text))

None

In [241]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [246]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [247]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [248]:
m = regex.match('wesm@bright.net')

In [249]:
m.groups()

('wesm', 'bright', 'net')

In [250]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [251]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [256]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 
'Rob': 'rob@gmail.com', 'Ryan': 'ryan@yahoo.com', 'Wes': np.nan}

In [257]:
data = pd.Series(data)

In [258]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Ryan      ryan@yahoo.com
Wes                  NaN
dtype: object

In [259]:
data.isnull()

Dave     False
Steve    False
Rob      False
Ryan     False
Wes       True
dtype: bool

In [260]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Ryan     False
Wes        NaN
dtype: object

In [261]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [264]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Ryan      [(ryan, yahoo, com)]
Wes                        NaN
dtype: object

In [265]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [266]:
matches

Dave     True
Steve    True
Rob      True
Ryan     True
Wes       NaN
dtype: object

In [269]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Ryan     ryan@
Wes        NaN
dtype: object